-- Filename: DB_Skill.lua
-- Author: auto-created by XmlToScript tool.
-- Function: it`s auto-created by XmlToScript tool.
--ExcelVBA output tools start flag
module("DB_CityConfig", package.seeall)
--{ID,名称（临时征用显示屏数）,引用地图ID,公共地图,解锁本城镇所需通关关卡,控制器ID,传送点1坐标{x,y},传送点1大小{x,y},传送过程1CG,传送目标城镇1ID,目标城镇1传入点坐标{x,y},传送点2坐标{x,y},传送点2大小{x,y},传送过程2CG,传送目标城镇2ID,目标城镇2传入点坐标{x,y},传送点3坐标{x,y},传送点3大小{x,y},传送过程3CG,传送目标城镇3ID,目标城镇3传入点坐标{x,y},传送点4坐标{x,y},传送点4大小{x,y},传送过程4CG,传送目标城镇4ID,目标城镇4传入点坐标{x,y},功能NPC1ID,功能NPC1位置{x,y},功能NPC1对应功能,功能NPC1配音,功能NPC2ID,功能NPC2位置{x,y},功能NPC2对应功能,功能NPC2配音,功能NPC3ID,功能NPC3位置{x,y},功能NPC3对应功能,功能NPC3配音,功能NPC4ID,功能NPC4位置{x,y},功能NPC4对应功能,功能NPC4配音,功能NPC5ID,功能NPC5位置{x,y},功能NPC5对应功能,功能NPC5配音,功能NPC6ID,功能NPC6位置{x,y},功能NPC6对应功能,功能NPC6配音,功能NPC7ID,功能NPC7位置{x,y},功能NPC7对应功能,功能NPC7配音,功能NPC8ID,功能NPC8位置{x,y},功能NPC8对应功能,功能NPC8配音,按钮入口1ID,按钮入口1位置{x,y},按钮入口1对应功能,按钮入口2ID,按钮入口2位置{x,y},按钮入口2对应功能,按钮入口3ID,按钮入口3位置{x,y},按钮入口3对应功能,按钮入口4ID,按钮入口4位置{x,y},按钮入口4对应功能,按钮入口5ID,按钮入口5位置{x,y},按钮入口5对应功能,按钮入口6ID,按钮入口6位置{x,y},按钮入口6对应功能,按钮入口7ID,按钮入口7位置{x,y},按钮入口7对应功能,按钮入口8ID,按钮入口8位置{x,y},按钮入口8对应功能,场景背景音乐,地图宽度,}

CityConfig = {
	[1] = {1,3,1,1,0,1001,{3160,10},{200,350},0,2,{360,250},{0,0},{0,0},0,0,{0,0},{0,0},{0,0},0,0,{0,0},{0,0},{0,0},0,0,{0,0},281,{1100,350},"",{},282,{2600,350},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,4031,3420,},
	[2] = {2,4,5,1,0,1011,{4300,10},{200,350},0,3,{360,250},{60,10},{200,350},0,1,{2960,250},{0,0},{0,0},0,0,{0,0},{0,0},{0,0},0,0,{0,0},285,{950,360},0,{},284,{2600,350},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,4040,4560,},
	[3] = {3,4,14,1,0,1021,{60,10},{200,350},0,2,{4100,250},{0,0},{0,0},0,0,{0,0},{0,0},{0,0},0,0,{0,0},{0,0},{0,0},0,0,{0,0},283,{1100,350},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,4032,4560,},
	[4] = {4,1,4,0,0,1031,{100,45},{200,100},0,1,{300,150},{0,0},{0,0},0,0,{0,0},{0,0},{0,0},0,0,{0,0},{0,0},{0,0},0,0,{0,0},16,{200,370},"homeshop",{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,59,1140,},
	[5] = {5,1,24,2,0,1041,{0,0},{0,0},0,0,{0,0},{0,0},{0,0},0,0,{0,0},{0,0},{0,0},0,0,{0,0},{0,0},{0,0},0,0,{0,0},16,{1510,275},0,{},17,{1830,285},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},235,{200,350},"guildinfo",236,{1815,250},"guildwar",237,{900,250},"guildbuild",238,{1250,250},"guildskill",239,{2130,250},"guildshop",240,{1540,250},"guildhello",0,{0,0},0,0,{0,0},0,4035,2280,},
	[6] = {6,3,3,1,0,1051,{3160,10},{200,350},0,7,{360,150},{60,10},{200,350},0,3,{4100,150},{0,0},{0,0},0,0,{0,0},{0,0},{0,0},0,0,{0,0},231,{850,390},0,{},232,{2000,390},0,{},233,{2600,390},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,4033,3420,},
	[7] = {7,4,15,1,0,1061,{4300,10},{200,350},0,8,{360,150},{60,10},{200,350},0,6,{2960,150},{0,0},{0,0},0,0,{0,0},{0,0},{0,0},0,0,{0,0},241,{590,310},0,{},242,{1990,310},0,{},243,{2190,310},0,{},244,{3920,310},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,4038,4560,},
	[8] = {8,4,12,1,0,1071,{4300,10},{200,350},0,9,{360,150},{60,10},{200,350},0,7,{4100,150},{0,0},{0,0},0,0,{0,0},{0,0},{0,0},0,0,{0,0},251,{1550,290},0,{},252,{2400,290},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,4039,4560,},
	[9] = {9,4,7,1,0,1081,{4300,10},{200,350},0,10,{360,150},{60,10},{200,350},0,8,{4100,150},{0,0},{0,0},0,0,{0,0},{0,0},{0,0},0,0,{0,0},261,{800,310},0,{},262,{1990,310},0,{},263,{3300,310},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,4034,4560,},
	[10] = {10,4,19,1,0,1091,{60,10},{200,350},0,9,{4100,150},{0,0},{0,0},0,0,{0,0},{0,0},{0,0},0,0,{0,0},{0,0},{0,0},0,0,{0,0},271,{1100,350},0,{},272,{1600,350},0,{},273,{2970,350},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,{},0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,0,{0,0},0,4037,4560,},
}
local mt = {}
local t_DB = {
["ID"] = 1,["Name"] = 2,["MapID"] = 3,["PublicMap"] = 4,["UnlockSection"] = 5,["ControllerID"] = 6,["TransPoint1Min"] = 7,["TransPoint1Max"] = 8,["TransPoint1CG"] = 9,["TargetCity1ID"] = 10,["TargetCity1Pos"] = 11,["TransPoint2Min"] = 12,["TransPoint2Max"] = 13,["TransPoint2CG"] = 14,["TargetCity2ID"] = 15,["TargetCity2Pos"] = 16,["TransPoint3Min"] = 17,["TransPoint3Max"] = 18,["TransPoint3CG"] = 19,["TargetCity3ID"] = 20,["TargetCity3Pos"] = 21,["TransPoint4Min"] = 22,["TransPoint4Max"] = 23,["TransPoint4CG"] = 24,["TargetCity4ID"] = 25,["TargetCity4Pos"] = 26,["NPC1ID"] = 27,["NPC1Pos"] = 28,["NPC1Function"] = 29,["NPC1Voice"] = 30,["NPC2ID"] = 31,["NPC2Pos"] = 32,["NPC2Function"] = 33,["NPC2Voice"] = 34,["NPC3ID"] = 35,["NPC3Pos"] = 36,["NPC3Function"] = 37,["NPC3Voice"] = 38,["NPC4ID"] = 39,["NPC4Pos"] = 40,["NPC4Function"] = 41,["NPC4Voice"] = 42,["NPC5ID"] = 43,["NPC5Pos"] = 44,["NPC5Function"] = 45,["NPC5Voice"] = 46,["NPC6ID"] = 47,["NPC6Pos"] = 48,["NPC6Function"] = 49,["NPC6Voice"] = 50,["NPC7ID"] = 51,["NPC7Pos"] = 52,["NPC7Function"] = 53,["NPC7Voice"] = 54,["NPC8ID"] = 55,["NPC8Pos"] = 56,["NPC8Function"] = 57,["NPC8Voice"] = 58,["Button1ID"] = 59,["Button1Pos"] = 60,["Button1Function"] = 61,["Button2ID"] = 62,["Button2Pos"] = 63,["Button2Function"] = 64,["Button3ID"] = 65,["Button3Pos"] = 66,["Button3Function"] = 67,["Button4ID"] = 68,["Button4Pos"] = 69,["Button4Function"] = 70,["Button5ID"] = 71,["Button5Pos"] = 72,["Button5Function"] = 73,["Button6ID"] = 74,["Button6Pos"] = 75,["Button6Function"] = 76,["Button7ID"] = 77,["Button7Pos"] = 78,["Button7Function"] = 79,["Button8ID"] = 80,["Button8Pos"] = 81,["Button8Function"] = 82,["City_BGM"] = 83,["Map_X"] = 84,
}
mt.__index =    function (table, key)
                return table[t_DB[key]]
            end

function getDataById(key_id)
    local id_data = CityConfig[key_id]

    if id_data == nil then
        return nil
    end
    if getmetatable(id_data) ~= nil then
        return id_data
    end
    setmetatable(id_data, mt)
    return id_data
end

function getArrDataByField(fieldName, fieldValue)
    local arrData = {}
    for k, v in pairs(CityConfig) do
        if getmetatable(v) == nil then
            setmetatable(v, mt)
        end
        if v[fieldName] == fieldValue then
            arrData[#arrData+1] = v
        end
    end

    return arrData
end

function release()
    _G["DB_CityConfig"] = nil
    package.loaded["DB_CityConfig"] = nil
    package.loaded["DBSystem/DB_CityConfig"] = nil
end
--ExcelVBA output tools end flag